POSTTEST 2
KECERDASAN BUATAN

NAMA    : RIANAWATI

NIM     : 2009106132

KELAS   : C2 2020

In [2]:
import pandas as pd
import numpy as np
from tabulate import tabulate

TAMPIL DATASET

In [3]:
dataset =pd.read_csv('netflix_titles.csv')
dataset

      Unnamed: 0  release_year
0              0          2020
1              1          2021
2              2          2021
3              3          2021
4              4          2021
...          ...           ...
8802        8802          2007
8803        8803          2018
8804        8804          2009
8805        8805          2006
8806        8806          2015

[8807 rows x 2 columns]

INFO DATASET

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    8807 non-null   int64
 1   release_year  8807 non-null   int64
dtypes: int64(2)
memory usage: 137.7 KB

JUMLAH RECORD

In [5]:
Jumlah_Record = len(dataset.index)
print("Jumlah Record", Jumlah_Record)

Jumlah Record 8807

NAMA ATRIBUT

In [6]:
Data_Atribut = list(dataset.columns)
Nama_Atribut = "\n".join(Data_Atribut)
print("Nama Atribut :\n",Nama_Atribut)

Nama Atribut :
 Unnamed: 0
release_year

JUMLAH ATRIBUT

In [7]:
Jumlah_Atribut = dataset.shape[1]
print("Jumlah Atribut", Jumlah_Atribut)

Jumlah Atribut 2

ATRIBUT TIPE OBJEK

In [8]:
Objek = len(dataset.dtypes[dataset.dtypes =='object'])
print("Jumlah Atribut dengan tipe objek =", Objek)

Jumlah Atribut dengan tipe objek = 0

ATRIBUT TIPE ANGKA

In [9]:
Int = len(dataset.dtypes[dataset.dtypes == 'int64'])
Float = len(dataset.dtypes[dataset.dtypes == 'float64'])
Angka = Int + Float
print("Jumlah Atribut dengan tipe Angka=", Angka)

Jumlah Atribut dengan tipe Angka= 2

ATRIBUT NILAI NULL

In [10]:
Null = dataset.isnull().any().sum()
print("Jumlah Atribut yang memiliki nilai null =", Null)

Jumlah Atribut yang memiliki nilai null = 0

TAMPILAN DALAM DICTIONARY

In [11]:
Dict= {
    "Jumlah Record" : [Jumlah_Atribut],
    "Nama Atribut"  :[Nama_Atribut],
    "Atribut Tipe Object": [Objek],
    "Atribut Tipe Angka" : [Angka],
    "Atribut Nilai NULL" : [Null],
}
tabel = pd.DataFrame(Dict)
print(tabulate(tabel, headers ='keys', tablefmt='psql', showindex=False))

+-----------------+----------------+-----------------------+----------------------+----------------------+
|   Jumlah Record | Nama Atribut   |   Atribut Tipe Object |   Atribut Tipe Angka |   Atribut Nilai NULL |
|-----------------+----------------+-----------------------+----------------------+----------------------|
|               2 | Unnamed: 0     |                     0 |                    2 |                    0 |
|                 | release_year   |                       |                      |                      |
+-----------------+----------------+-----------------------+----------------------+----------------------+

Rata-rata, Standar Deviasi, Nilai Maksimum, Q1, Q2, dan Q3 dari Atribut Bertipe Angka

In [12]:
desc = dataset.describe()
desc.rename(index = {"count" : "Jumlah Data", "Mean" : "Rata Rata", "std": "Standar Deviasi",
                     "min" : "Nilai Minimum", "25%": "Q1", "50%": "Q2", "75%": "Q3", "max": "Nilai Maksimal"},inplace = True)
desc

                  Unnamed: 0  release_year
Jumlah Data      8807.000000   8807.000000
mean             4403.000000   2014.180198
Standar Deviasi  2542.506244      8.819312
Nilai Minimum       0.000000   1925.000000
Q1               2201.500000   2013.000000
Q2               4403.000000   2017.000000
Q3               6604.500000   2019.000000
Nilai Maksimal   8806.000000   2021.000000

NILAI KORELASI

In [13]:
dataset.corr()

              Unnamed: 0  release_year
Unnamed: 0      1.000000     -0.246713
release_year   -0.246713      1.000000

ATRIBUT BERTIPE ANGKA MENJADI DESIMAL 3 ANGKA DIBELAKANG KOMA

In [14]:
dataset['release_year']*0.001

0       2.020
1       2.021
2       2.021
3       2.021
4       2.021
        ...
8802    2.007
8803    2.018
8804    2.009
8805    2.006
8806    2.015
Name: release_year, Length: 8807, dtype: float64

10 RECORD PERTAMA BERTIPE ANGKA

In [15]:
numerics = ['int64', 'float64']
number = dataset.select_dtypes(include=numerics).copy()
number.head(10)

   Unnamed: 0  release_year
0           0          2020
1           1          2021
2           2          2021
3           3          2021
4           4          2021
5           5          2021
6           6          2021
7           7          1993
8           8          2021
9           9          2021

MENYIMPAN DATASET DENGAN ATRIBUT BERTIPE ANGKA KE DALAM FILE CSV

In [17]:
number.to_csv('netflix_angka.csv')